import randominfo
person = randominfo.Person()
print(person.full_name, person.gender, person.country, person.address)
print(person.get_details())
'''                     Небольшой разбор

    Если я правильно понял то в .csv файле нет country, следовательно при 
    создании дикта адресса его неоткуда доставать - можно удалить.
    Ошибка была в индексах при читании данных из файла. Тоесть под тот же street
    попадала строка landmark и дальше все сыпалось.
    Так же, в попытках понять нормально ли то что country отсутствует, я нашел функцию из 4 строки.
    Я понял что get_country тоже ссылаеться на столбы файла csv которые не существуют
    Честно я не понял в каком месте попортили скрипт/csv файл, но по мере решения я заметил,
    что get_hobbies тоже ссылалось на следующий столб после hobbies в файле csv, и оно выводило рандомную улицу
    вместо хобби. Это я тоже пофиксил. Теперь все выводит правильно кроме country, там пусто'''
